In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.3.5'

In [16]:
csv_file='taxi+_zone_lookup.csv'

In [17]:
df = pd.read_csv(csv_file, nrows = 100)

In [18]:
from sqlalchemy import create_engine

In [19]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [20]:
print(pd.io.sql.get_schema(df, name='zones', con=engine))

CREATE TABLE zones (
	"LocationID" BIGINT,
	"Borough" TEXT,
	"Zone" TEXT,
	service_zone TEXT
)

In [22]:
df_iter = pd.read_csv(csv_file, iterator=True, chunksize=100000)

In [23]:
df = next(df_iter)

In [24]:
len(df)

265

In [26]:
df.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [27]:
df.head(n=0)

Empty DataFrame
Columns: [LocationID, Borough, Zone, service_zone]
Index: []

In [28]:
df.head(n=0).to_sql(name='zones', con=engine, if_exists='replace')

In [30]:
%time df.to_sql(name='zones', con=engine, if_exists='append')

CPU times: user 6.58 ms, sys: 3.34 ms, total: 9.92 ms
Wall time: 13.3 ms